Repository: atomstech-io/xblock-scorm
Catalog: scormxblock/translations/*/LC_MESSAGES/text.po
Languages: ar, de_de, es_419, fr, ja_jp, pl, pt_br

source: Display Name
ar: اسم العرض
de_de: Angezeigter Name
es_419: Nombre para mostrar
fr: Afficher le nom
ja_jp: 表示名
pl: Wyświetlana nazwa
pt_br: Exibir Nome

source: Display name for this module
ar: اسم العرض لهذه الوحدة
de_de: Angezeigter Name für dieses Modul
es_419: Nombre para mostrar de este módulo
fr: Afficher le nom pour ce module
ja_jp: このモジュールの表示名
pl: Wyświetlana nazwa dla tego modułu
pt_br: Exibir nome para este módulo

source: Description
ar: الوصف
de_de: Beschreibung
es_419: Descripción
ja_jp: 内容
pl: Opis
pt_br: Descrição

source: Brief description of the SCORM modules will be displayed above the player. Can contain HTML.
ar: سيتم عرض وصف مختصر لوحدات SCORM أعلى المشغل. يمكن أن يحتوي على HTML.
de_de: Kurze Beschreibung der SCORM-Module wird über dem Player angezeigt. Kann HTML beinhalten.
es_419: Arriba del reproductor, se mostrará una descripción breve de los módulos SCORM. Se puede incluir un archivo HTML.
fr: Une brève description des modules SCORM sera affichée au-dessus du lecteur. Pourrait contenir du HTML.
ja_jp: プレイヤーの上部にSCORMモジュールの簡単な説明が表示されます。HTMLを含めることができます。
pl: Opis modułów SCORM. Zostanie wyświetlony nad odtwarzaczem. Może zawierać kod HTML.
pt_br: Uma breve descrição dos módulos SCORM será exibida acima do player. Pode conter HTML.

source: Upload scorm file (.zip)
ar: تحميل ملف SCORM (zip.)
de_de: Scorm-Datei hochladen (.zip)
es_419: Cargar archivo scorm (.zip)
fr: Télécharger un fichier scorm (.zip)
ja_jp: scormファイル（.zip）をアップロードする
pl: Prześlij plik scorm (.zip)
pt_br: Carregar arquivo scorm (.zip)

source: Upload a new SCORM package.
ar: تحميل حزمة SCORM جديدة.
de_de: Ein neues SCORM-Paket hochladen.
es_419: Cargue un paquete SCORM nuevo.
fr: Télécharger un nouveau paquetage SCORM.
ja_jp: 新規SCORMパッケージをアップロードします。
pl: Prześlij nowy pakiet SCORM.
pt_br: Carregar um novo pacote SCORM.

source: SCORM player
ar: مشغل SCORM
es_419: Reproductor SCORM
fr: Lecteur SCORM
ja_jp: SCORMプレイヤー
pl: Odtwarzacz SCORM
pt_br: Player do SCORM

source: SCORM player configured in Django settings, or index.html file contained in SCORM package
ar: تم تكوين مشغل SCORM في إعدادات Django، أو ملف index.html الموجود في حزمة SCORM
de_de: SCORM-Player in Django-Einstellungen konfiguriert, oder in SCORM-Paket enthaltene index.html Datei
es_419: El reproductor SCORM se configuró en los ajustes Django, o bien en el archivo index.html que se incluye en el paquete SCORM
fr: Lecteur SCORM configuré dans les paramètres de Django, ou fichier index.html contenu dans le paquetage SCORM
ja_jp: Django設定で設定したSCORMプレイヤー、またはSCORMパッケージに含まれているindex.htmlファイル
pl: Odtwarzacz SCORM skonfigurowany w ustawieniach Django lub plik index.html zawarty w pakiecie SCORM
pt_br: Player do SCORM configurado nas configurações do Django, ou arquivo index.html contido no pacote SCORM

source: SCORM block's problem weight in the course, in points. If not graded, set to 0
ar: وزن مشكلة كتلة SCORM في الدورة بالنقاط. إذا لم يتم تقديره، فقم بالتعيين على 0
de_de: Gewichtung des Problems des SCORM-Blocks im Kurs, in Punkten. Wenn nicht benotet, auf 0 setzen
es_419: Se refiere a la ponderación de problemas en el bloque de SCORM en el curso, expresado en puntos. Si no está calificado, se establece en 0.
fr: La pondération du problème du blocage SCORM dans le cours, en points. À défaut de note, mettre à 0
ja_jp: 点数で表したコースのSCORMブロックの問題の重み。未評価の場合は、0に設定
pl: Waga problemu bloku SCORM w kursie wyrażona w punktach. Jeśli nie podlega ocenie, ustaw wartość 0.
pt_br: Peso do problema do bloco SCORM no curso, em pontos. Se não for avaliado, será definido como 0

source: Enable completion upon viewing SCORM file
ar: تمكين الإكمال عند عرض ملف SCORM
de_de: Abschluss nach Ansicht der SCORM-Datei aktivieren
es_419: Permitir que se marque como finalizado tras visualizar el archivo SCORM
fr: Activer la fonction de finalisation dès la visualisation du fichier SCORM
ja_jp: SCORMファイルの表示後に完了にする
pl: Umożliwiaj ukończenie po wyświetleniu pliku SCORM
pt_br: Ativar conclusão ao visualizar o arquivo SCORM

source: Locking
ar: إغلاق
de_de: Sperrung
es_419: Bloqueando
fr: Verrouillage
ja_jp: ロック中
pl: Blokowanie
pt_br: Bloqueando

source: Enable requirement to complete SCORM content before moving to next module
ar: تمكين المتطلب لإكمال محتوى SCORM قبل الانتقال إلى الوحدة التالية
de_de: Anforderung zum Abschluss des SCORM-Inhalts aktivieren, bevor es mit dem nächsten Modul weitergeht
es_419: Permitir que se requiera completar el contenido SCORM antes de avanzar al próximo módulo
fr: Activer l'exigence de terminer le contenu SCORM avant de passer au module suivant
ja_jp: 次のモジュールに移動する前にSCORMコンテンツを完了する要件を有効にする
pl: Włącz wymaganie ukończenia zawartości SCORN przed przejściem do następnego modułu
pt_br: Ative o requisito para concluir o conteúdo do SCORM antes de passar para o próximo módulo

source: Display Type
ar: نوع العرض
de_de: Anzeigenart
es_419: Tipo para mostrar
fr: Afficher le type
ja_jp: 表示名
pl: Typ wyświetlania
pt_br: Exibir Tipo

source: Open in a new popup window, or an iframe. This setting may be overridden by player-specific configuration.
ar: فتح في نافذة منبثقة جديدة أو إطار داخلي. يمكن تجاوز هذا الإعداد بواسطة تكوين خاص بالمشغل.
de_de: In einem neuen Popup-Fenster oder einem iframe öffnen. Diese Einstellung kann von Player-spezifischen Konfigurationen überschrieben werden.
es_419: Se abre en una ventana emergente nueva o en un IFrame nuevo. Es posible que estos ajustes se anulen debido a la configuración específica del reproductor.
fr: Ouvrir dans une nouvelle fenêtre contextuelle, ou une image intra. Ce paramètre peut être remplacé par une configuration spécifique au lecteur.
ja_jp: 新規ポップアップウィンドウ、またはiframeで開きます。この設定は、プレイヤー固有の設定でオーバーライドされます。
pl: Otwieraj w nowym wyskakującym okienku lub w ramce iframe
pt_br: Abra em uma nova janela pop-up ou iframe. Esta configuração pode ser substituída pela configuração específica do player.

source: Popup Launch Type
ar: نوع التشغيل المنبثق
de_de: Launchart des Popup
es_419: Tipo de inicio emergente
fr: Type de fenêtre contextuelle
ja_jp: ポップアップ起動タイプ
pl: Typ wyskakującego okienka
pt_br: Tipo de inicialização pop-up

source: Open in a new popup through button or automatically.
ar: فتح في إطار منبثق جديد عبر الزر أو تلقائياً.
de_de: Durch Schaltfläche oder automatisch in einem neuen Popup öffnen.
es_419: Se abre en un elemento emergente nuevo desde abajo, o bien de forma automática.
fr: Ouvrir dans une nouvelle fenêtre contextuelle en cliquant sur le bouton ou automatiquement.
ja_jp: 新規ポップアップをボタンまたは自動で開きます。
pl: Otwieraj w nowym wyskakującym okienku po naciśnięciu przycisku lub automatycznie.
pt_br: Abra em um novo pop-up por meio do botão ou automaticamente.

source: Launch Button Text
ar: نص زر التشغيل
de_de: Text für Launch-Schaltfläche
es_419: Texto del botón Inicio
fr: Texte du bouton de démarrage
ja_jp: ボタン起動のテキスト
pl: Tekst przycisku wyskakującego okienka
pt_br: Texto do botão de inicialização

source: Display text for Launch Button
ar: عرض النص لزر التشغيل
de_de: Text für Launch-Schaltfläche anzeigen
es_419: Mostrar texto para el botón Inicio
fr: Afficher le texte du bouton de démarrage
ja_jp: ボタン起動のテキストを表示
pl: Tekst widoczny na przycisku wyskakującego okienka
pt_br: Exibir texto para o botão de inicialização

source: Display Width (px)
ar: عرض العرض (البكسل)
de_de: Anzeigebreite (px)
es_419: Mostrar ancho (px)
fr: Largeur d'écran (px)
ja_jp: 幅（px）を表示
pl: Szerokość wyświetlania w pikselach
pt_br: Exibir largura (px)

source: Width of iframe or popup window
ar: عرض الإطار الداخلي أو النافذة المنبثقة
de_de: Breite von iframe oder Popup-Fenster
es_419: Ancho de IFrame o de la ventana emergente
fr: Largeur de l'image intra ou de la fenêtre contextuelle
ja_jp: iframeまたはポップアップウィンドウの幅
pl: Szerokość ramki iframe lub wyskakującego okienka
pt_br: Largura do iframe ou da janela pop-up

source: Display Height (px)
ar: ارتفاع العرض (البكسل)
de_de: Anzeigehöhe (px)
es_419: Mostrar alto (px)
fr: Hauteur de l'écran (px)
ja_jp: 高さ（px）を表示
pl: Wysokość wyświetlania w pikselach
pt_br: Exibir altura (px)

source: Height of iframe or popup window
ar: ارتفاع الإطار الداخلي أو النافذة المنبثقة
de_de: Breite von iframe oder Popup-Fenster
es_419: Alto de IFrame o de la ventana emergente
fr: Hauteur de l'image intra ou de la fenêtre contextuelle
ja_jp: iframeまたはポップアップウィンドウの高さ
pl: Wysokość ramki ifram lub wyskakującego okienka
pt_br: Altura do iframe ou da janela pop-up

source: SCORM Package text encoding
ar: ترميز نص حزمة SCORM
de_de: Textkodierung des SCORM-Pakets
es_419: Codificación de texto del paquete SCORM
fr: Codage du texte du paquetage SCORM
ja_jp: SCORMパッケージのテキストエンコーディング
pl: Kodowanie tekstu pakietu SCORM
pt_br: Codificação de texto do pacote SCORM

source: Character set used in SCORM package. Defaults to cp850 (or IBM850), for Latin-1: Western European languages)
ar: مجموعة الأحرف المستخدمة في حزمة SCORM. الإعدادات الافتراضية هي cp850 (أو IBM850)، للغات اللاتينية-1: اللغات الأوروبية الغربية)
de_de: Im SCORM-Paket verwendeter Zeichensatz. Voreingestellt auf cp850 (oder IB:M850), für Latin-1:Westeuropäische Sprachen)
es_419: Se estableció el uso de caracteres en el paquete SCORM. Los valores predeterminados a cp850 (o IBM850) para Latin-1: idiomas de Europa Occidental)
fr: Jeu de caractères utilisé dans le paquetage SCORM. Par défaut, cp850 (ou IBM850), pour le Latin-1 : langues d'Europe occidentale)
ja_jp: SCORMパッケージで使用される文字セット。デフォルトはcp850（またはIBM850）、Latin-1: 西ヨーロッパ言語
pl: Zestaw znaków używany w pakiecie SCORM. Domyślnie cp850 (lub IBM850 dla kodowania Latin-1 dla języków zachodnioeuropejskich)
pt_br: Conjunto de caracteres usado no pacote SCORM. O padrão é cp850 (ou IBM850), para Latin-1: idiomas da Europa Ocidental)

source: Player Configuration
ar: تهيئة المشغل
de_de: Player-Konfiguration
es_419: Configuración del reproductor
fr: Configuration du lecteur
ja_jp: プレイヤー設定
pl: Konfiguracja odtwarzacza
pt_br: Configuração do player

source: JSON object string with overrides to be passed to selected SCORM player. These will be exposed as data attributes on the host iframe and sent in a window.postMessage to the iframe's content window. Attributes can be any. 'Internal player' will always check this field for an 'initial_html' attribute to override index.html as the initial page.
ar: سلسلة كائن JSON مع تجاوزات ليتم تمريرها إلى مشغل SCORM المحدد. سيتم عرضها كسمات بيانات على مضيف iframe وإرسالها في window.postMessage إلى نافذة محتوى iframe. يمكن أن تكون السمات أي شيء. سيتحقق \"المشغل الداخلي\" دائمًا من هذا الحقل بحثًا عن سمة \"initial_html\" لتجاوز index.html كصفحة أولية.
de_de: JSON Objekt-String mit Overrides, die an den ausgewählten SCORM-Player weitergegeben werden sollen. Diese werden als Datenattribute im Host-iframe angezeigt und in einer window.postMessage an das Inhaltsfenster des iframe gesendet. Attribute können beliebig sein. ‚Internal Player‘ überprüft dieses Feld immer auf ein anfängliches ‚initial_html‘-Attribut, um index.html als Anfangsseite zu überschreiben.
es_419: Cadena de objetos JSON con anulaciones que se transfieren al reproductor SCORM seleccionado. Estos se muestran como atributos de datos en el hospedador IFrame y se envían en una ventana. Publicar mensaje para el contenido de ventana de IFrame. Se puede incluir cualquier atributo. El 'reproductor predeterminado' siempre comprueba este campo en busca de un atributo que anule el archivo index.html como página de inicio.
fr: Chaîne d'objets JSON avec des annulations à faire passer au lecteur SCORM sélectionné. Ces derniers seront visibles en tant qu'attributs de données sur l'image intra hôte et envoyés dans un window.postMessage à la fenêtre du contenu de l'image intra. Les attributs peuvent être de toutes sortes. Le "lecteur interne" vérifiera toujours dans ce champ la présence d'un attribut "initial_html" pour remplacer index.html comme la page initiale.
ja_jp: 選択されたSCORMプレイヤーに渡される優先JSONオブジェクト文字列。ホストiframeでデータ属性として公開され、iframeのコンテンツウィンドウにwindow.postMessageで送信されます。属性は任意です。「内部プレイヤー」は「initial_htm」属性に対してこのフィールドを常にチェックし、初期ページとしてindex.htmlをオーバーライドします。
pl: Ciąg znaków obiektu JSON z wymuszeniami, który zostanie przekazany do wybranego odtwarzacza SCORM. Zostaną one udostępnione jako atrybuty danych hostu ramki iframe i wysłane w window.postMessage do okna z zawartością ramki iframe. Atrybuty mogą być dowolne. Wewnętrzny odtwarzacz zawsze sprawdzi to pole, aby nadpisać index.html atrybutem initial_html jako stronę startową.
pt_br: Cadeia de caracteres do objeto JSON com substituições a serem passadas para o player do SCORM selecionado. Eles serão expostos como atributos de dados no iframe do host e enviados em um window.postMessage para a janela de conteúdo do iframe. Os atributos podem ser qualquer um. ''Player interno'' sempre verificará este campo para um atributo ''initial_html'' para substituir index.html como a página inicial.

source: Scorm File Name
ar: اسم ملف SCORM
de_de: Name der Scorm-Datei
es_419: Nombre del archivo Scorm
fr: Nom du fichier Scorm
ja_jp: Scormファイル名
pl: Nazwa pliku scorm
pt_br: Nome do arquivo Scorm

source: Scorm Package Uploaded File Name
ar: اسم الملف الذي تم تحميله بحزمة SCORM
de_de: Name der hochgeladenen Scorm-Paketdatei
es_419: Se cargó el nombre de archivo del paquete Scrom
fr: Nom du paquetage Scorm téléchargé
ja_jp: Scormパッケージがアップロードされたファイル名
pl: Nazwa przesłanego pliku pakietu scorm
pt_br: Nome do arquivo carregado do pacote Scorm

source: Question
ar: السؤال
de_de: Frage
es_419: Pregunta
ja_jp: 質問
pl: Pytanie
pt_br: Pergunta

source: Answer
ar: الإجابة
de_de: Antwort
es_419: Respuesta
fr: Réponse
ja_jp: 回答
pl: Odpowiedź
pt_br: Resposta

source: Submissions count
ar: عدد عمليات الإرسال
de_de: Zahl der Einreichungen
es_419: Recuento de entregas
fr: Nombre de soumissions
ja_jp: 提出回数
pl: Liczba zgłoszeń
pt_br: Contagem de envios
